# Є список [0,5,2,4,7,1,3,19]. Написати Python-скрипт для підрахунку непарних цифр у ньому.

a=[0,5,2,4,7,1,3,19]
sum_=0
count=0
for i in a:
    if i%2:
        sum_+=i
        count+=1
print(sum_,count)

#
# За допомогою циклів вивести на екран усі прості числа від 1 до 100

for i in range(1,101):
    for j in range(2,i):
        if i%j==0:
            break
    else:
        print(i)

# Написати Python - скрипт, який виводить на екран усі числа в діапазоні від 1 до 100 кратні 7

[print(i) for i in range(1, 101) if not i % 7]


# Створіть список випадкових чисел (розміром 4 елементи). Створіть другий список у два рази більше першого,
# де перші 4 елементи повинні дорівнювати елементам першого списку, а решта елементів - подвоєним значенням початкових.
# Наприклад,
# Було → [1,4,7,2]
# Стало → [1,4,7,2,2,8,14,4]

import random

list_,list_2=[],[]
for i in range(4):
    list_.append(random.randint(1, 1_000_000))
for j in list_:
    j*=2
    list_2.append(j)
print(list_+list_2)


# 4. Написати Python-скрипт, який виводить на екран прямокутник із '*'.
# Висота і ширина прямокутника вводяться з клавіатури.
# Наприклад, нижче представлений прямокутник з висотою 4 та шириною 5.

n,m = int(input()),int(input())
res=f'{"*"*m}\n'+ f"*{' ' *(m-2)}*\n"*(n-2) + f"{'*'*m}\n"
print(res)

# Написати код для дзеркального перевороту списку [7,2,9,4] -> [4,9,2,7].

list_=list(input())
list_.reverse()
print(list_)

#
# Створіть список із 12 елементів. Кожен елемент цього списку є зарплатою робітника за місяць.
# Виведіть цей список на екран та обчисліть середньомісячну зарплату цього робітника.

list_ = []
for i in range(12):
    list_.append(list(map(int,input())))
    print(list_[i])
    print(sum(list_[i]) / len(list_[i]))

#
# 11. Виведіть на екран «пісочний годинник», максимальна ширина якого зчитується з клавіатури (число непарне).
# У прикладі ширина дорівнює 5.
n = int(input())
res = []
j = 0
for i in range(n, 0, -2):
    res.append(f"{' ' * j}{'*' * i}")
    j += 1
res += res[-2::-1]
result = '\n'.join(res)
print(result)


# 8. Є матриця
# [1, 2, 3, 4]
# [5, 6, 7, 8]
# [9,10, 11, 12]
# [13,14, 15, 16]
# Напишіть Python-скрипт, який виведе цю матрицю на екран, обчислить та виведе суму елементів цієї матриці.

list_ = [[1, 2, 3, 4], [5, 6, 7, 8], [9, 10, 11, 12], [13, 14, 15, 16]]

sum_i=[]
for i in list_:
    for j in i:
        print(j, end=' ')
    print()
for i in range(4):
    sum = 0
    for j in range(4):
        sum += list_[i][j]
    sum_i.append(sum)
print(sum_i[0]+sum_i[1]+